<?php
$score=[
    "1"=>[
        "國文"=>07,
        "英文"=>40,
        "數學"=>05,
    ],
    
    "2"=>[
        "國文"=>45,
        "英文"=>70,
        "數學"=>10,
    ],
    
    "3"=>[
        "國文"=>70,
        "英文"=>50,
        "數學"=>80,
    ],
    
    "4"=>[
        "國文"=>05,
        "英文"=>04,
        "數學"=>01,
    ],
    
    "5"=>[
        "國文"=>50,
        "英文"=>70,
        "數學"=>01,
    ]
    
    

];

if(isset($_GET['num'])){
    $num=$_GET['num'];
    echo "學生座號". $num. "的成績:<br>";
    echo "國文成績". $score[$num]['國文'] ."分<br>";
    echo "英文成績". $score[$num]['英文'] ."分<br>";
    echo "數學成績". $score[$num]['數學'] ."分<br>";

}


?>
<a href="student.html">回學生列表</a>